Switch>en
Switch#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int range f0/1,f0/4,f0/5
Switch(config-if-range)#switchport mode access 
Switch(config-if-range)#switchport access vlan 10
% Access VLAN does not exist. Creating vlan 10
Switch(config-if-range)#ex
--------------------
Switch(config)#int range f0/2,f0/6,f0/7
Switch(config-if-range)#switchport mode access 
Switch(config-if-range)#switchport access vlan 20
% Access VLAN does not exist. Creating vlan 20
Switch(config-if-range)#ex
------------------------
Switch(config)#int range f0/3,f0/8,f0/9
Switch(config-if-range)#switchport mode access 
Switch(config-if-range)#switchport access vlan 30
% Access VLAN does not exist. Creating vlan 30
Switch(config-if-range)#ex
----------------------
Switch(config)#vlan 10
Switch(config-vlan)#name math
Switch(config-vlan)#ex
Switch(config)#vlan 20
Switch(config-vlan)#name programming
Switch(config-vlan)#ex
Switch(config)#vlan 30
Switch(config-vlan)#name algorithms
Switch(config-vlan)#ex
